/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_bzero.c                                         :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: klupin <klupin@student.21-school.ru>       +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/10/13 00:04:25 by klupin            #+#    #+#             */
/*   Updated: 2021/10/14 21:41:24 by liana            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

/*Согласно MAN, эта функция записывает нули в первые n байтов в строке s.
 * Если n равно нулю, то ft_bzero ничего не делает. Другими словами, мы создаём
 * строку размером n и заполняем каждую индексную позицию нулём.
 * Функция ничего не возвращает*/

void	ft_bzero(void *s, size_t n)
{
	unsigned char	*str;

	str = (unsigned char *) s;
	while (n > 0)
	{
		str[n - 1] = 0;
		n--;
	}
}
