/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_putendl_fd.c                                    :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: klupin <klupin@student.21-school.ru>       +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/10/18 00:18:24 by klupin            #+#    #+#             */
/*   Updated: 2021/10/28 15:57:01 by klupin           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

/*Эта функция записывает строку s в дескриптор файла fd, за которой следует '\n'
 * чтобы сделать новую строку. Эта функция точно такая же, как и наша функция
 * ft_putendl, за исключением того, что мы принимаем в качестве параметра
 * дескриптор файла.*/

void	ft_putendl_fd(char *s, int fd)
{
	if (s != NULL)
	{
		ft_putstr_fd(s, fd);
		ft_putchar_fd('\n', fd);
	}
}
